Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: False for an index the engine reports as invalid, which queries skip and exports leave out
fr: Faux pour un index que le moteur signale comme invalide, ce qui fait que les requêtes sautent et les exportations omettent.

source: No Warnings
fr: Pas d'avertissements
ko: 경고 없음
tr: Uyarı Yok
vi: Không có cảnh báo
zh_hans: 没有警告
zh_hant: 沒有警告

source: Save Report…
fr: Enregistrer le rapport...

source: Binary content
fr: Contenu binaire
ko: 이진 콘텐츠
tr: İkili içerik
vi: Nội dung nhị phân
zh_hans: 二进制内容
zh_hant: 二進位內容

source: Run this EXPLAIN again after a change to compare the two plans.
fr: Exécutez cette EXPLAIN à nouveau après un changement pour comparer les deux plans.
ko: 변경한 뒤 이 EXPLAIN을 다시 실행하면 두 플랜을 비교할 수 있습니다.
tr: İki planı karşılaştırmak için bir değişiklikten sonra bu EXPLAIN'i yeniden çalıştırın.
vi: Chạy lại EXPLAIN này sau khi thay đổi để so sánh hai kế hoạch.
zh_hans: 更改后再次运行此 EXPLAIN，即可比较两个计划。
zh_hant: 更改後再次執行此 EXPLAIN，即可比較兩個計劃。

source: output_path must name a file inside the Downloads folder.
fr: output_path doit nommer un fichier à l'intérieur du dossier Téléchargements.
ko: output_path는 다운로드 폴더 안의 파일을 가리켜야 합니다.
tr: output_path, İndirilenler klasörünün içindeki bir dosyayı belirtmelidir.
vi: output_path phải trỏ tới một tệp bên trong thư mục Downloads.
zh_hans: output_path 必须指向下载文件夹内的文件。
zh_hant: output_path 必須指向下載檔案夾內的檔案。

source: Failed
fr: Échec
ko: 실패
tr: Başarısız
vi: Thất bại
zh_hans: 失败
zh_hant: 失敗

source: The plugin was built for an incompatible runtime.
fr: Le plugin a été construit pour un environnement d'exécution incompatible.
ko: 이 플러그인은 호환되지 않는 런타임용으로 빌드되었습니다.
tr: Eklenti uyumsuz bir çalışma zamanı için derlenmiş.
vi: Plugin được xây dựng cho một runtime không tương thích.
zh_hans: 该插件是为不兼容的运行时构建的。
zh_hant: 該外掛是為不相容的執行環境建置的。

source: backslash
fr: barre oblique inverse
ko: 백슬래시
tr: ters eğik çizgi
vi: dấu gạch chéo ngược
zh_hans: 反斜杠
zh_hant: 反斜線

source: Notify about
fr: Informer sur
ko: 알림 대상
tr: Şunlar için bildir
vi: Thông báo về
zh_hans: 通知内容
zh_hant: 通知內容

source: This connection loads SQLite extensions, and their functions can read and write files. A statement from outside TablePro can call only the functions built into SQLite. Run this one in TablePro instead.
fr: Cette connexion charge les extensions SQLite, et leurs fonctions peuvent lire et écrire des fichiers. Une instruction provenant de l'extérieur de TablePro ne peut appeler que les fonctions intégrées à SQLite. Exécutez-en une dans TablePro à la place.

source: The driver cannot delete a row marked for deletion.
fr: Le conducteur ne peut pas supprimer une ligne marquée pour suppression.

source: Nothing here matches the search.
fr: Rien ici ne correspond à la recherche.

source: false
fr: faux

source: Configure an AI provider in Settings to start chatting.
fr: Configurez un fournisseur d'IA dans Paramètres pour commencer à chatter.
ko: 채팅을 시작하려면 설정에서 AI 제공업체를 구성하십시오.
tr: Sohbet başlatmak için Ayarlar'dan bir yapay zeka sağlayıcısı yapılandırın.
vi: Cấu hình nhà cung cấp AI trong Cài đặt để bắt đầu trò chuyện.
zh_hans: 在设置中配置 AI 提供商以开始对话。
zh_hant: 在設定中設定 AI 供應商以開始對話。

source: TablePro cannot use this pattern, so the rule matches nothing
fr: TablePro ne peut pas utiliser ce motif, donc la règle ne correspond à rien.

source: Copy as Hex
fr: Copier sous forme hexadécimale
ko: 16진수로 복사
tr: Hex Olarak Kopyala
vi: Sao chép dạng Hex
zh_hans: 复制为十六进制
zh_hant: 複製為十六進位

source: Default page size:
fr: Taille de la page par défaut :
ko: 기본 페이지 크기:
tr: Varsayılan sayfa boyutu:
vi: Kích thước trang mặc định:
zh_hans: 默认页面大小:
zh_hant: 預設頁面大小：

source: Override auto-detected CLI paths per database type.
fr: Survolte des chemins CLI détectés automatiquement par type de base de données.
ko: 데이터베이스 유형별로 자동 감지된 CLI 경로를 재정의합니다.
tr: Veritabanı türüne göre otomatik algılanan CLI yollarını geçersiz kılın.
vi: Ghi đè đường dẫn CLI tự phát hiện cho từng loại cơ sở dữ liệu.
zh_hans: 按数据库类型覆盖自动检测的 CLI 路径。
zh_hant: 依資料庫型別覆寫自動偵測的 CLI 路徑。

source: Apply Filter
fr: Appliquer le filtre
ko: 필터 적용
tr: Filtre Uygula
vi: Áp dụng bộ lọc
zh_hans: 应用筛选
zh_hant: 套用篩選

source: Filter by name
fr: Filtrer par nom
ko: 이름으로 필터링
tr: Ada göre filtrele
vi: Lọc theo tên
zh_hans: 按名称筛选
zh_hant: 依名稱篩選

source: Delete Selected
fr: Supprimer sélectionné
ko: 선택 항목 삭제
tr: Seçileni Sil
vi: Xóa mục đã chọn
zh_hans: 删除所选
zh_hant: 刪除所選

source: Total Time
fr: Temps total
ko: 총 시간
tr: Toplam Süre
vi: Tổng thời gian
zh_hans: 总耗时
zh_hant: 總耗時

source: The staged changes are being saved.
fr: Les changements scénarisés sont en train d'être enregistrés.

source: Open in Finder
fr: Ouvrir dans le Finder
ko: Finder에서 열기
tr: Finder'da Göster
vi: Mở trong Finder
zh_hans: 在访达中打开
zh_hant: 在 Finder 中打開

source: A partitioned table
fr: Une table partagée

source: Last Page
fr: Dernière page
ko: 마지막 페이지
tr: Son Sayfa
vi: Trang cuối
zh_hans: 最后一页
zh_hant: 最後一頁

source: Import stopped
fr: L'importation a été arrêtée.

source: The table needs a name.
fr: La table a besoin d'un nom.

source: Remove Duplicate Rows…
fr: Supprimer les lignes en double...

source: Enter Credentials Here
fr: Entrez vos informations de connexion ici

source: Distributed HTAP, MySQL-compatible
fr: HTAP distribué, compatible avec MySQL

source: MCP Access Request
fr: Demande d'accès MCP
ko: MCP 접근 요청
tr: MCP Erişim İsteği
vi: Yêu cầu truy cập MCP
zh_hans: MCP 访问请求
zh_hant: MCP 存取要求

source: %@ is too wide for this engine to index whole, so only a prefix is indexed. Rows differing only past it are refused as duplicates.
fr: %@ est trop large pour que ce moteur puisse indexer l'ensemble, donc seuls des préfixes sont indexés. Les lignes qui diffèrent seulement après cela sont refusées comme des doublons.

source: Your organization requires Safe Mode to be at least %@ on every connection.
fr: Votre organisation exige que le mode sécurisé soit au moins %@ sur chaque connexion.

source: This connection was deleted on another device or window. Your changes were not saved.
fr: Cette connexion a été supprimée sur un autre appareil ou fenêtre. Vos modifications n'ont pas été enregistrées.
ko: 이 연결이 다른 기기 또는 창에서 삭제되었습니다. 변경 사항은 저장되지 않았습니다.
tr: Bu bağlantı başka bir aygıtta veya pencerede silindi. Değişiklikleriniz kaydedilmedi.
vi: Kết nối này đã bị xóa trên thiết bị hoặc cửa sổ khác. Các thay đổi của bạn chưa được lưu.
zh_hans: 此连接已在其他设备或窗口中被删除。你的更改未保存。
zh_hant: 此連線已在其他裝置或視窗中被刪除。你的變更未儲存。

source: status = 'active'
fr: Statut = 'actif'

source: This replaces the original statement in the editor with the AI-generated SQL. If the statement has changed since, the SQL opens in a new query instead. Nothing runs until you execute it.
fr: Cela remplace la déclaration originale dans l'éditeur par le SQL généré par l'IA. Si la déclaration a changé depuis lors, le SQL s'ouvre dans une nouvelle requête à la place. Rien ne s'exécute tant que vous ne l'exécutez pas.

source: Pre-Connect Script
fr: Script de pré-connexion
ko: 연결 전 스크립트
tr: Bağlantı Öncesi Betik
vi: Script pre-connect
zh_hans: 连接前脚本
zh_hant: 連線前指令稿

source: AWS SSM Session
fr: Session AWS SSM

source: Couldn't Copy DDL
fr: Impossible de copier le DDL

source: The source and the destination are the same database.
fr: La source et la destination sont la même base de données.

source: SQL Query
fr: Requête SQL
ko: SQL 쿼리
tr: SQL Sorgusu
vi: Truy vấn SQL
zh_hans: SQL 查询
zh_hant: SQL 查詢

source: Recent query history for a connection (supports ?limit=, ?search=, ?date_filter=)
fr: Historique des requêtes récentes pour une connexion (prend en charge ?limit=, ?search=, ?date_filter=)
ko: 연결의 최근 쿼리 기록(?limit=, ?search=, ?date_filter= 지원)
tr: Bir bağlantının son sorgu geçmişi (?limit=, ?search=, ?date_filter= destekler)
vi: Lịch sử truy vấn gần đây của một kết nối (hỗ trợ ?limit=, ?search=, ?date_filter=)
zh_hans: 连接的最近查询历史（支持 ?limit=、?search=、?date_filter=）
zh_hant: 連線的最近查詢記錄（支援 ?limit=、?search=、?date_filter=）

source: Connection name
fr: Nom de la connexion
ko: 연결 이름
tr: Bağlantı adı
vi: Tên kết nối
zh_hans: 连接名称
zh_hant: 連線名稱

source: Select a step in the plan to see what it does.
fr: Sélectionnez une étape du plan pour voir ce qu'elle fait.
ko: 작업을 확인할 실행 계획 단계를 선택하십시오.
tr: Ne yaptığını görmek için plandaki bir adımı seçin.
vi: Chọn một bước trong kế hoạch để xem nó làm gì.
zh_hans: 选择执行计划中的一个步骤，查看它做了什么。
zh_hant: 選擇執行計畫中的一個步驟，查看它做了什麼。

source: Save failed: %@
fr: Sauvegarde échouée : %@
ko: 저장 실패: %@
tr: Kaydetme başarısız: %@
vi: Lưu thất bại: %@
zh_hans: 保存失败：%@
zh_hant: 儲存失敗：%@

source: Unknown URL scheme: %@
fr: Scheme URL inconnu : %@
ko: 알 수 없는 URL 스킴: %@
tr: Bilinmeyen URL şeması: %@
vi: URL scheme không xác định: %@
zh_hans: 未知的 URL scheme：%@
zh_hant: 未知的 URL scheme：%@

source: Connects straight to the host and port on the General tab.
fr: Se connecte directement à l'hôte et au port dans l'onglet Général.

source: Move the connection's browse cursor to another schema. This changes what the user sees.
fr: Déplacez le curseur de navigation de la connexion vers un autre schéma. Cela change ce que l'utilisateur voit.
ko: 연결의 탐색 위치를 다른 스키마로 옮깁니다. 사용자가 보는 내용이 바뀝니다.
tr: Bağlantının gezinme imlecini başka bir şemaya taşır. Bu, kullanıcının gördüğünü değiştirir.
vi: Chuyển con trỏ duyệt của kết nối sang một schema khác. Điều này thay đổi những gì người dùng thấy.
zh_hans: 把连接的浏览位置切换到另一个 Schema。这会改变用户看到的内容。
zh_hant: 把連線的瀏覽位置切換到另一個綱要。這會改變使用者看到的內容。

source: Copy %1$lld objects to %2$@
fr: Copier les objets %1$lld vers %2$@

source: Schema the session is on
fr: Schéma la session est en cours
ko: 세션이 사용 중인 스키마
tr: Oturumun bulunduğu şema
vi: Schema mà phiên đang dùng
zh_hans: 该会话所在的 Schema
zh_hant: 該工作階段所在的綱要

source: Process id, accepted by stop_server_session
fr: Identifiant du processus, accepté par stop_server_session
ko: stop_server_session이 받는 프로세스 id
tr: stop_server_session tarafından kabul edilen işlem kimliği
vi: Process id, được stop_server_session chấp nhận
zh_hans: 进程 id，可被 stop_server_session 接受
zh_hant: 行程 id，可被 stop_server_session 接受

source: Export query results and tables to Excel format.
fr: Exporter les résultats et les tableaux des requêtes de recherche au format Excel.
ko: 쿼리 결과와 테이블을 Excel 형식으로 내보냅니다.
tr: Sorgu sonuçlarını ve tabloları Excel biçiminde dışa aktarın.
vi: Xuất kết quả truy vấn và bảng sang định dạng Excel.
zh_hans: 将查询结果和表导出为 Excel 格式。
zh_hant: 將查詢結果與資料表匯出為 Excel 格式。

# %@ wants to access '%@' (%@).
source: %1$@ wants to access '%2$@' (%3$@).
fr: %1$@ veut accéder à '%2$@' (%3$@).

source: New %@…
fr: Nouveau %@...
ko: 새 %@…
tr: Yeni %@…
vi: %@ mới…
zh_hans: 新建 %@…
zh_hant: 新增 %@…

source: Curly quote (%1$@). SQL needs the straight quote (%2$@).
fr: Citation entre guillemets croisés (%1$@). SQL a besoin de la citation entre guillemets droits (%2$@).
ko: 둥근 따옴표(%1$@). SQL은 곧은 따옴표(%2$@)만 인식합니다.
tr: Kıvrık tırnak (%1$@). SQL düz tırnak (%2$@) bekler.
vi: Dấu nháy cong (%1$@). SQL cần dấu nháy thẳng (%2$@).
zh_hans: 弯引号（%1$@）。SQL 需要直引号（%2$@）。
zh_hant: 彎引號（%1$@）。SQL 需要直引號（%2$@）。

source: The object types taking part in the comparison are set in Options.
fr: Les types d'objets participant à la comparaison sont définis dans les options.
ko: 비교에 포함할 객체 유형은 옵션에서 설정합니다.
tr: Karşılaştırmaya katılan nesne türleri Seçenekler'de ayarlanır.
vi: Các loại đối tượng tham gia so sánh được đặt trong Tùy chọn.
zh_hans: 参与比较的对象类型在“选项”中设置。
zh_hant: 參與比較的物件類型在「選項」中設定。

source: AND
fr: Et
tr: VE

source: The Cloud SQL Auth Proxy failed to start.
fr: Le proxy Cloud SQL Auth n'a pas pu démarrer.
ko: Cloud SQL Auth Proxy를 시작하지 못했습니다.
tr: Cloud SQL Auth Proxy başlatılamadı.
vi: Cloud SQL Auth Proxy không khởi động được.
zh_hans: Cloud SQL Auth Proxy 启动失败。
zh_hant: Cloud SQL Auth Proxy 啟動失敗。

source: Query timeout applies only to database drivers that support it. Use 0 for no limit. Reconnect to apply changes.
fr: Le temps d'attente de la requête ne s'applique qu'aux pilotes de base de données qui le prennent en charge. Utilisez 0 pour aucune limite. Reconnectez-vous pour appliquer les modifications.

source: Use ~/.pgpass
fr: Utilisez ~/.pgpass
ko: ~/.pgpass 사용
tr: ~/.pgpass kullan
vi: Sử dụng ~/.pgpass
zh_hans: 使用 ~/.pgpass
zh_hant: 使用 ~/.pgpass

source: Verification code rejected. Get a new code from your authenticator app and try again.
fr: Code de vérification rejeté. Obtenez un nouveau code à partir de votre application d'authentification et réessayez.
ko: 인증 코드가 거부되었습니다. 인증 앱에서 새 코드를 받아 다시 시도하십시오.
tr: Doğrulama kodu reddedildi. Kimlik doğrulayıcı uygulamanızdan yeni bir kod alın ve yeniden deneyin.
vi: Mã xác minh bị từ chối. Lấy mã mới từ ứng dụng xác thực và thử lại.
zh_hans: 验证码被拒绝。请从验证器应用获取新验证码后重试。
zh_hant: 驗證碼被拒絕。請從你的驗證器應用程式取得新的驗證碼後再試一次。

source: Switch Connection (⌘⌥C)
fr: Changer la connexion (⌘⌥C)
ko: 연결 전환 (⌘⌥C)
vi: Chuyển kết nối (⌘⌥C)
zh_hans: 切换连接 (⌘⌥C)
zh_hant: 切換連線 (⌘⌥C)

source: No saved connection with ID "%@".
fr: Aucune connexion enregistrée avec l'ID "%@".
ko: ID가 "%@"인 저장된 연결이 없습니다.
tr: "%@" ID'li kayıtlı bağlantı yok.
vi: Không có kết nối đã lưu với ID "%@".
zh_hans: 未找到 ID 为 "%@" 的已保存连接。
zh_hant: 找不到 ID 為「%@」的已儲存連線。

source: Fit to Window
fr: Adapté à la fenêtre
ko: 윈도우에 맞추기
tr: Pencereye Sığdır
vi: Vừa cửa sổ
zh_hans: 适合窗口
zh_hant: 符合視窗

source: Status: success
fr: Statut : succès
ko: 상태: 성공
tr: Durum: başarılı
vi: Trạng thái: thành công
zh_hans: 状态：成功
zh_hant: 狀態：成功

source: Model not found: %@
fr: Modèle non trouvé : %@
ko: 모델을 찾을 수 없음: %@
tr: Model bulunamadı: %@
vi: Không tìm thấy model: %@
zh_hans: 未找到模型：%@
zh_hant: 找不到模型：%@

source: right square bracket
fr: Bracket carré droit
ko: 닫는 대괄호
tr: sağ köşeli parantez
vi: dấu ngoặc vuông đóng
zh_hans: 右方括号
zh_hant: 右方括號

source: Split each value into new columns at every match.
fr: Divisez chaque valeur en nouvelles colonnes à chaque correspondance.
ko: 일치할 때마다 각 값을 새 열로 분할합니다.
tr: Her değeri, her eşleşmede yeni sütunlara ayırır.
vi: Tách mỗi giá trị thành các cột mới tại mọi vị trí khớp.
zh_hans: 在每个匹配处将每个值拆分到新列中。
zh_hant: 在每個符合處將每個值拆分到新欄位中。

# Page size must be between %@ and %@
source: Page size must be between %1$@ and %2$@
fr: La taille de la page doit être comprise entre %1$@ et %2$@.
ko: 페이지 크기는 %1$@에서 %2$@ 사이여야 합니다
tr: Page size must be arasında %@ and %@
vi: Kích thước trang phải nằm trong khoảng %1$@ đến %2$@
zh_hans: 页面大小必须在 %@ 和 %@ 之间
zh_hant: 頁面大小必須介於 %1$@ 與 %2$@ 之間

source: Errors
fr: Erreurs

source: Whether the index backs the primary key
fr: Que l'indice soutienne la clé primaire ou non
ko: 인덱스가 기본 키를 뒷받침하는지 여부
tr: İndeksin birincil anahtarı destekleyip desteklemediği
vi: Chỉ mục có phục vụ khoá chính hay không
zh_hans: 该索引是否支撑主键
zh_hant: 該索引是否支撐主鍵

source: Check the tunnel host and your network, then try again.
fr: Vérifiez l'hôte du tunnel et votre réseau, puis réessayez.
ko: 터널 호스트와 네트워크를 확인한 후 다시 시도하십시오.
tr: Tünel sunucusunu ve ağınızı kontrol edip tekrar deneyin.
vi: Kiểm tra máy chủ tunnel và mạng của bạn, rồi thử lại.
zh_hans: 请检查隧道主机和网络，然后重试。
zh_hant: 請檢查隧道主機與網路，然後再試一次。

source: Configure an active provider to enable inline suggestions.
fr: Configurez un fournisseur actif pour activer les suggestions en ligne.
ko: 인라인 제안을 사용하려면 활성 제공업체를 구성하십시오.
tr: Satır içi önerileri etkinleştirmek için aktif bir sağlayıcı yapılandırın.
vi: Cấu hình một nhà cung cấp đang hoạt động để bật gợi ý nội tuyến.
zh_hans: 配置活动提供方以启用内联建议。
zh_hant: 設定一個啟用中的供應商以開啟行內建議。

source: Window
fr: Fenêtre
ko: 윈도우
tr: Pencere
vi: Cửa sổ
zh_hans: 窗口
zh_hant: 視窗

source: View
fr: Voir
ko: 보기
tr: Görünüm
vi: Xem
zh_hans: 视图
zh_hant: 檢視

source: The prepared connection no longer matches this driver.
fr: La connexion préparée ne correspond plus à ce pilote.

source: Increase font size
fr: Augmenter la taille de la police
ko: 글꼴 크기 늘리기
tr: Yazı boyutunu büyüt
vi: Tăng cỡ chữ
zh_hans: 增大字号
zh_hant: 增大字型大小

source: Editing
fr: Édition
ko: 편집 중
tr: Düzenleniyor
vi: Đang sửa
zh_hans: 编辑中
zh_hant: 編輯中

source: Delete %lld rows?
fr: Supprimer %lld lignes ?
ko: 행 %lld개를 삭제하시겠습니까?
tr: %lld satır silinsin mi?
vi: Xóa %lld dòng?
zh_hans: 删除 %lld 行？
zh_hant: 要刪除 %lld 列嗎？

source: Adds a Recent section with the connections you opened lately to the welcome window and the connection switcher.
fr: Ajoute une section Récents avec les connexions que vous avez ouvertes récemment à la fenêtre d'accueil et au commutateur de connexion.
ko: 최근에 연 연결을 모은 최근 항목 섹션을 시작 윈도우와 연결 전환기에 추가합니다.
tr: Son açtığınız bağlantıları içeren bir Son Kullanılanlar bölümünü hoş geldiniz penceresine ve bağlantı değiştiriciye ekler.
vi: Thêm mục Gần đây gồm các kết nối bạn mở gần đây vào cửa sổ chào mừng và trình chuyển đổi kết nối.
zh_hans: 在欢迎窗口和连接切换器中添加“最近”区域，列出你最近打开的连接。
zh_hant: 在歡迎視窗與連線切換器中加入「最近」區塊，列出你最近開啟的連線。

source: only in the target
fr: Seulement dans la cible

source: Directory object
fr: Objet de répertoire

source: Copy Label
fr: Copier l'étiquette

source: Stage
fr: Scène

source: admin
fr: administratif
tr: yönetici

source: Explain Query
fr: Expliquer la requête
ko: 쿼리 설명
tr: Sorguyu Açıkla
vi: Giải thích truy vấn
zh_hans: 解释查询
zh_hant: 解釋查詢

source: Choose
fr: Choisir
ko: 선택
tr: Seç
vi: Chọn
zh_hans: 选择
zh_hant: 選擇

source: Database that was dropped
fr: Base de données qui a été abandonnée
ko: 삭제된 데이터베이스
tr: Silinen veritabanı
vi: Cơ sở dữ liệu đã bị xoá
zh_hans: 已删除的数据库
zh_hant: 已刪除的資料庫

source: Max output tokens
fr: Nombre maximum de jetons de sortie
ko: 최대 출력 토큰 수
tr: Maksimum çıktı token'ları
vi: Số token đầu ra tối đa
zh_hans: 最大输出令牌数
zh_hant: 最大輸出權杖數

source: Confirm Destructive Operation
fr: Confirmer l'opération destructrice
ko: 파괴적 작업 확인
tr: Yıkıcı İşlemi Onayla
vi: Xác nhận thao tác phá hủy
zh_hans: 确认破坏性操作
zh_hant: 確認破壞性操作

source: Use as Active Database
fr: Utiliser comme base de données active
ko: 활성 데이터베이스로 사용
tr: Etkin Veritabanı Olarak Kullan
vi: Dùng làm cơ sở dữ liệu hoạt động
zh_hans: 用作活动数据库
zh_hant: 用作使用中的資料庫

source: Unsupported MongoDB method: %@
fr: Méthode MongoDB non prise en charge : %@
ko: 지원되지 않는 MongoDB 메서드: %@
vi: Phương thức MongoDB không được hỗ trợ: %@
zh_hans: 不支持的 MongoDB 方法：%@
zh_hant: 不支援的 MongoDB 方法：%@

source: Identical
fr: Identique
ko: 동일
tr: Aynı
vi: Giống hệt
zh_hans: 完全相同
zh_hant: 完全相同

source: This engine offers only mode 'kill' for stopping a session.
fr: Ce moteur ne propose qu'un seul mode "kill" pour arrêter une session.

source: This database keeps names beginning with %@ for itself.
fr: Cette base de données garde pour elle les noms commençant par %@.

source: Published %d saved queries to your team.
fr: %d requêtes sauvegardées ont été publiées pour votre équipe.
ko: 저장된 쿼리 %d개를 팀에 게시했습니다.
tr: %d kayıtlı sorgu takımınıza yayınlandı.
vi: Đã xuất bản %d truy vấn đã lưu cho nhóm của bạn.
zh_hans: 已将 %d 条保存的查询发布给团队。
zh_hant: 已將 %d 條已儲存的查詢發佈給團隊。

source: The port comes from this connection's own port, forwarded from the resource you name here.
fr: Le port provient du port de cette connexion elle-même, transmis depuis la ressource que vous nommez ici.

source: Failed at line %lld
fr: Échec à la ligne %lld
ko: 줄 %lld에서 실패했습니다
tr: Satır %lld'de başarısız
vi: Thất bại tại dòng %lld
zh_hans: 在第 %lld 行失败
zh_hant: 在第 %lld 行失敗

source: Agent: full tool access including destructive DDL. Safe mode still gates execution.
fr: Agent : accès complet aux outils, y compris à la DDL destructrice. Le mode sûr limite toujours l'exécution.
ko: 에이전트: 파괴적인 DDL을 포함한 모든 도구에 접근할 수 있습니다. 안전 모드에서도 실행을 제한합니다.
tr: Ajan: yıkıcı DDL dahil tüm araçlara erişim. Güvenli mod yürütmeyi yine de denetler.
vi: Agent: toàn quyền dùng công cụ, gồm cả DDL phá hủy. Chế độ an toàn vẫn kiểm soát việc thực thi.
zh_hans: Agent：可使用全部工具，包括破坏性DDL。安全模式仍会控制执行。
zh_hant: Agent：可使用全部工具，包括破壞性的 DDL。安全模式仍會控管執行。

source: Command line tool failed: %@
fr: L'outil de ligne de commande a échoué : %@
ko: 명령줄 도구 실패: %@
tr: Komut satırı aracı başarısız oldu: %@
vi: Công cụ dòng lệnh thất bại: %@
zh_hans: 命令行工具失败：%@
zh_hant: 命令列工具失敗：%@

source: CRITICAL: Transaction rollback failed - database may be in inconsistent state: %@
fr: CRITIQUE : Réversion de la transaction échouée - la base de données peut être dans un état incohérent : %@
ko: 심각: 트랜잭션 롤백 실패 - 데이터베이스가 일관되지 않은 상태일 수 있음: %@
tr: CRITICAL: Transaction rollback failed - database may be giriş inconsistent state: %@
vi: NGHIÊM TRỌNG: Hoàn tác giao dịch thất bại - cơ sở dữ liệu có thể ở trạng thái không nhất quán: %@
zh_hans: 严重：事务回滚失败 - 数据库可能处于不一致状态：%@
zh_hant: 嚴重：交易還原失敗 - 資料庫可能處於不一致狀態：%@

source: Default value
fr: Valeur par défaut
ko: 기본값
tr: Varsayılan değer
vi: Giá trị mặc định
zh_hans: 默认值
zh_hant: 預設值

source: Schema names inside a database, on engines that have schemas.
fr: Les noms des schémas à l'intérieur d'une base de données, sur les moteurs qui ont des schémas.
ko: 스키마를 지원하는 엔진에서 데이터베이스 안의 스키마 이름입니다.
tr: Şemaya sahip motorlarda, bir veritabanının içindeki şema adları.
vi: Tên các schema bên trong một cơ sở dữ liệu, trên những engine có schema.
zh_hans: 在有 Schema 概念的引擎上，某个数据库内的 Schema 名称。
zh_hant: 在有綱要概念的引擎上，某個資料庫內的綱要名稱。

source: External Table
fr: Table externe
ko: 외부 테이블
tr: Harici Tablo
zh_hans: 外部表
zh_hant: 外部資料表

source: Scope
fr: Portée
ko: 범위
tr: Kapsam
vi: Phạm vi
zh_hans: 范围
zh_hant: 範圍

# Column count mismatch on line %d: expected %d columns, found %d.
source: Column count mismatch on line %1$d: expected %2$d columns, found %3$d.
fr: Inégalité de nombre de colonnes sur la ligne %1$d : %2$d colonnes attendues, %3$d colonnes trouvées.
ko: %1$d번째 줄의 열 수가 일치하지 않습니다. 예상: %2$d개, 실제: %3$d개.
tr: %d. satırda sütun sayısı uyuşmuyor: %d sütun bekleniyordu, %d bulundu.
vi: Số cột không khớp ở dòng %d: cần %d cột, tìm thấy %d.
zh_hans: 第%d行列数不匹配：期望%d列，实际%d列。
zh_hant: 第 %1$d 行欄位數不符：預期 %2$d 個欄位,實際 %3$d 個。

# Failed to parse statement at line %lld: %@
source: Failed to parse statement at line %1$lld: %2$@
fr: Échec de la parsemation de l'instruction à la ligne %1$lld : %2$@
ko: 줄 %1$lld의 문을 구문 분석하지 못했습니다: %2$@
tr: Failed to parse ifade at line %lld: %@
vi: Phân tích câu lệnh thất bại tại dòng %1$lld: %2$@
zh_hans: 在第 %lld 行解析语句失败: %@
zh_hant: 在第 %1$lld 行解析陳述式失敗：%2$@

source: Value
fr: Valeur
ko: 값
tr: Değer
vi: Giá trị
zh_hans: 值
zh_hant: 值

source: Rules
fr: Règles
ko: 규칙
tr: Kurallar
vi: Quy tắc
zh_hans: 规则
zh_hant: 規則

source: Clear Selection
fr: Supprimer la sélection
ko: 선택 해제
tr: Seçimi Temizle
vi: Bỏ chọn
zh_hans: 取消选择
zh_hant: 清除選取範圍

source: This change needs %@ to be recreated, and it cannot be recreated from the definition the database stored for it. Virtual tables, such as full-text search tables, are the usual reason.
fr: Ce changement nécessite que %@ soit recréé, et il ne peut pas être recréé à partir de la définition stockée dans la base de données pour lui. Les tables virtuelles, telles que les tables de recherche de texte intégral, sont la raison habituelle.

source: Restrict to one connection. Omit for every readable connection.
fr: Restreindre à une seule connexion. Omettre pour chaque connexion lisible.
ko: 한 연결로 제한합니다. 읽을 수 있는 모든 연결을 대상으로 하려면 생략하십시오.
tr: Tek bir bağlantıyla sınırlar. Okunabilir tüm bağlantılar için boş bırakın.
vi: Giới hạn trong một kết nối. Bỏ trống để lấy mọi kết nối đọc được.
zh_hans: 限定为一个连接。省略则表示所有可读的连接。
zh_hant: 限定為一個連線。省略則表示所有可讀取的連線。

source: External Access
fr: Accès externe
ko: 외부 접근
tr: Harici Erişim
vi: Truy cập bên ngoài
zh_hans: 外部访问
zh_hant: 外部存取
